In [3]:
print("Hello World !")

Hello World !

In [5]:
import pandas as pd

In [7]:
import numpy as np

In [19]:
df = pd.read_csv(r"C:\Users\MOHAMMED\Desktop\Correlation One\Project\archive\Extended_Employee_Performance_and_Productivity_Data.csv")

In [17]:
 pd.read_html(r"https://www.worldometers.info/world-population/world-population-by-year/")

[    Year  World Population Yearly Change  Net Change  Density (P/KmÂ²)
 0   2024        8161972572        0.87 %  70237642.0             55.0
 1   2023        8091734930        0.88 %  70327738.0             54.0
 2   2022        8021407192        0.84 %  66958801.0             54.0
 3   2021        7954448391        0.86 %  67447099.0             53.0
 4   2020        7887001292        0.97 %  75707594.0             53.0
 ..   ...               ...           ...         ...              ...
 92 -1000          50000000           NaN         NaN              NaN
 93 -2000          27000000           NaN         NaN              NaN
 94 -3000          14000000           NaN         NaN              NaN
 95 -4000           7000000           NaN         NaN              NaN
 96 -5000           5000000           NaN         NaN              NaN

 [97 rows x 5 columns]]

In [21]:
df.head()

,Employee_ID,Department,Gender,Age,Job_Title,Hire_Date,Years_At_Company,Education_Level,Performance_Score,Monthly_Salary,Work_Hours_Per_Week,Projects_Handled,Overtime_Hours,Sick_Days,Remote_Work_Frequency,Team_Size,Training_Hours,Promotions,Employee_Satisfaction_Score,Resigned
0,1,IT,Male,55,Specialist,03:05.6,2,High School,5,6750,33,32,22,2,0,14,66,0,2.63,False
1,2,Finance,Male,29,Developer,03:05.6,0,High School,5,7500,34,34,13,14,100,12,61,2,1.72,False
2,3,Finance,Male,55,Specialist,03:05.6,8,High School,3,5850,37,27,6,3,50,10,1,0,3.17,False
3,4,Customer Support,Female,48,Analyst,03:05.6,7,Bachelor,2,4800,52,10,28,12,100,10,0,1,1.86,False
4,5,Engineering,Female,36,Analyst,03:05.6,3,Bachelor,2,4800,38,11,29,13,100,15,9,1,1.25,False

In [23]:
df.tail()

,Employee_ID,Department,Gender,Age,Job_Title,Hire_Date,Years_At_Company,Education_Level,Performance_Score,Monthly_Salary,Work_Hours_Per_Week,Projects_Handled,Overtime_Hours,Sick_Days,Remote_Work_Frequency,Team_Size,Training_Hours,Promotions,Employee_Satisfaction_Score,Resigned
99995,99996,Finance,Male,27,Technician,03:05.6,1,Bachelor,4,4900,55,46,5,3,75,16,48,2,1.28,False
99996,99997,IT,Female,36,Consultant,03:05.6,6,Master,5,8250,39,35,7,0,0,10,77,1,3.48,True
99997,99998,Operations,Male,53,Analyst,03:05.6,8,High School,2,4800,31,13,6,5,0,5,87,1,2.60,False
99998,99999,HR,Female,22,Consultant,03:05.6,9,High School,5,8250,35,43,10,1,75,2,31,1,3.10,False
99999,100000,Finance,Female,43,Analyst,03:05.6,0,PhD,1,4400,51,43,27,11,75,13,45,1,2.64,False

In [27]:
df["Department"]

0                      IT
1                 Finance
2                 Finance
3        Customer Support
4             Engineering
               ...
99995             Finance
99996                  IT
99997          Operations
99998                  HR
99999             Finance
Name: Department, Length: 100000, dtype: object

In [29]:
df["Monthly_Salary"].describe()

count    100000.000000
mean       6403.211000
std        1372.508717
min        3850.000000
25%        5250.000000
50%        6500.000000
75%        7500.000000
max        9000.000000
Name: Monthly_Salary, dtype: float64

In [31]:
df["Training_Hours"].sum()

4950606

In [39]:
dfgroup = df.groupby('Department').mean('Age')